#@ # 
#@ # Running lm_shell Version V-2023.12 for linux64 -- Nov 23, 2023
#@ # Date:   Sat Mar 23 10:44:56 2024
#@ # Run by: vlsi@elc-p07-2088-05-lnx
#@ 

start_gui &
gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
create_workspace -flow exploration -technology /home/vlsi/Desktop/dont_deleteee_sec16_solyman/digital_labs/ASIC_project/StandardCell/SAED90nm_EDK_10072017/SAED_EDK90nm/Technology_Kit/techfiles/saed90nm_1p9m_cd.tf ExplorationWorkspace
create_workspace -flow exploration -technology /home/vlsi/Desktop/dont_deleteee_sec16_solyman/digital_labs/ASIC_project/StandardCell/SAED90nm_EDK_10072017/SAED_EDK90nm/Digital_Standard_cell_Library/process/astro/tech/astroTechFile.tf ExplorationWorkspace
change_selection [get_workspaces {ExplorationWorkspace}]
change_selection [get_workspaces {ExplorationWorkspace}]
change_selection [get_workspaces {ExplorationWorkspace}]
read_lef /home/vlsi/Downloads/saed90nmEditted.lef
read_db { /home/vlsi/Desktop/dont_deleteee_sec16_solyman/digital_labs/ASIC_project/StandardCell/SAED90nm_EDK_10072017/SAED_EDK90nm/Digital_Standard_cell_Library/synopsys/models/saed90nm_max_lth.db }
change_selection [get_workspaces {ExplorationWorkspace}]
change_selection [get_workspaces {ExplorationWorkspace}]
change_selection [get_workspaces {ExplorationWorkspace}]
change_selection [get_workspaces {ExplorationWorkspace}]
set_app_options -list {design.enable_lib_cell_editing {mutable}}
set_app_options -list {lib.workspace.save_layout_views {true}}
set_app_options -list {lib.workspace.save_design_views {true}}
set_app_options -list {lib.workspace.keep_all_physical_cells {true}}
change_selection [get_libs {saed90nmEditted}]
change_selection [get_libs {saed90nm_max_lth}]
change_selection [get_libs {saed90nmEditted}]
change_selection [get_libs {saed90nm_max_lth}]
change_selection [get_libs {saed90nm_max_lth}]
change_selection [get_workspaces {ExplorationWorkspace}]
change_selection [get_workspaces {ExplorationWorkspace}]
read_db { /home/vlsi/Desktop/dont_deleteee_sec16_solyman/digital_labs/ASIC_project/StandardCell/SAED90nm_EDK_10072017/SAED_EDK90nm/Digital_Standard_cell_Library/synopsys/models/saed90nm_max_lth.db }
read_lef /home/vlsi/Downloads/saed90nmEditted.lef
change_selection [get_workspaces {ExplorationWorkspace}]
change_selection [get_libs {saed90nm_max_lth}]
change_selection [get_libs {saed90nmEditted}]
change_selection [get_libs {saed90nmEditted}]
change_selection [get_workspaces {ExplorationWorkspace}]
change_selection [get_libs {saed90nmEditted}]
change_selection [get_libs {saed90nmEditted}]
change_selection [get_workspaces {ExplorationWorkspace}]
change_selection [get_workspaces {ExplorationWorkspace}]
read_db { /home/vlsi/Desktop/dont_deleteee_sec16_solyman/digital_labs/ASIC_project/StandardCell/SAED90nm_EDK_10072017/SAED_EDK90nm/Digital_Standard_cell_Library/synopsys/models/saed90nm_max_lth.db }
read_lef /home/vlsi/Desktop/dont_deleteee_sec16_solyman/digital_labs/ASIC_project/StandardCell/SAED90nm_EDK_10072017/SAED_EDK90nm/Digital_Standard_cell_Library/lef/saed90nmEditted.lef
change_selection [get_workspaces {ExplorationWorkspace}]
change_selection [get_designs -filter {view_name == design} {AND2X1}]
current_block saed90nmEditted:AND2X1.design
win_set_filter -visible -class cell -filter {assembly_die_margin clock_margin hard_macro_margin hard_margin route_blockage_margin seal_ring_margin soft_margin} -layer {}
win_set_filter -visible -class pseudo_bump -filter {deleted} -layer {}
win_set_filter -visible -class pseudo_tsv -filter {deleted} -layer {}
win_set_filter -visible -class placement_blockage -filter {wiring} -layer {0-77}
win_set_filter -expand_cell_types {soft_macro  }
win_set_select_class -visible {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pseudo_tsv pin_blockage block_shielding topology_node topology_edge topology_repeater annotation_shape core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_filter -class cell -filter {array assembly_die_margin clock_margin hard_macro_margin hard_margin route_blockage_margin seal_ring_margin soft_margin} -layer {}
win_set_filter -class pseudo_bump -filter {deleted} -layer {}
win_set_filter -class pseudo_tsv -filter {deleted} -layer {}
win_set_filter -class placement_blockage -filter {wiring} -layer {0-77}
win_set_select_class {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pseudo_tsv pin_blockage topology_node topology_edge topology_repeater annotation_shape edit_group shape via placement_blockage }
group_libs
process_workspaces  -directory /home/vlsi/Desktop/dont_deleteee_sec16_solyman/digital_labs/ASIC_project/ndm
change_selection [get_workspaces {ExplorationWorkspace}]
